Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: perlartistic has been added: it is the Artistic License in pod format, making it easier for modules to refer to it.
es_es: perlartistic ha sido añadido: se trata de la Licencia Artística en formato pod, haciendo más fácil para los módulos referirse a ella.

source: It also can't be used to go into a construct that is optimized away.
es_es: Tampoco puede ser usada para ir a una construcción que ha sido optimizada.

source: In fact, text strings are never in any other format!
es_es: (de hecho, es el único formato de las cadenas de texto).

source: =head2 How can I convince others to use Perl?
es_es: =head2 ¿Cómo puedo animar a otros programadores a probar Perl?

source: The v-ful version (v1.2.3) will become obsolete.
es_es: La versión v-ful (v1.2.3) se convertirá en obsoleta.

source: Similarly, interpolating an array with no elements is the same as if no array had been interpolated at that point.
es_es: Del mismo modo, la interpolación de un array sin elementos es lo mismo que si no se hubiera interpolado ningún array en ese punto.

source: As such, C<glob("*.c *.h")> matches all files with a F<.c> or F<.h> extension.
es_es: En este sentido, C<glob("*.c *.h")> coincide con todos los archivos con una extensión F<.c> o F<.h>.

source: One possible scenario is when output of an application has included hash data.
es_es: Un posible escenario es cuando la salida de una aplicación ha incluido datos hash.

source: =item quotemeta EXPR X<quotemeta> X<metacharacter>
es_es: =item quotemeta EXPR X<quotemeta> X<metacharacter> X<metacarácter>

source: To prevent confusion, you may wish to avoid such package names as well.
es_es: Para evitar confusiones, evite nombres de paquete también de esta manera.

source: These are documented in L<perlvar>.
es_es: Se describen en L<perlvar>.

source: tr/a-zA-Z/ /cs; # change non-alphas to single space
es_es: tr/a-zA-Z/ /cs; # cambia los caracteres no alfabéticos por un solo espacio

source: It's also the source of a useful idiom for executing a function or performing an operation in list context and then counting the number of return values, by assigning to an empty list and then using that assignment in scalar context.
es_es: Es también el origen de un modismo muy útil para ejecutar una función o realizar una operación en contexto lista, y luego contar el número de valores devueltos, mediante la asignación a una lista vacía y luego usar esa asignación en el contexto escalar.

source: A scalar represents a single value:
es_es: Un escalar representa un solo valor:

source: There's a lot to know about character sets, and text encodings.
es_es: Hay mucho que aprender sobre juegos de caracteres y codificaciones de texto.

source: foreach $file (@ARGV) {
es_es: foreach $archivo (@ARGV) {

source: Typically, either the string is a result of C<pack>, or the characters of the string represent a C structure of some kind.
es_es: Por lo general, ya sea la cadena es un resultado de C<pack>, o los caracteres de la cadena representan una estructura de C de algún tipo.

source: C<read> into a UTF8-encoded buffer with an offset off the end of the buffer no longer mis-calculates buffer lengths.
es_es: C<read> en un búfer codificado en UTF8 con un desplazamiento más allá del final del búfer ya no calcula mal la longitud del búfer.

source: Then rerun the tests.
es_es: A continuación, vuelva a ejecutar las pruebas.

source: =item sort LIST
es_es: =item sort LISTA

source: =item dbmopen HASH,DBNAME,MASK X<dbmopen> X<dbm> X<ndbm> X<sdbm> X<gdbm>
es_es: =item dbmopen HASH,DBNAME,MÁSCARA X<dbmopen> X<dbm> X<ndbm> X<sdbm> X<gdbm>

source: When unpacking, C<A> strips trailing whitespace and nulls, C<Z> strips everything after the first null, and C<a> returns data with no stripping at all.
es_es: Al desempaquetar, C<A> elimina el espacio en blanco y nulos sobrantes del final, C<Z> elimina todo después del primer nulo, y C<a> devuelve los datos sin ningún tipo de recorte.

source: Works only for fixed-width look-behind.
es_es: Sólo funciona para antecedentes de ancho fijo.

source: The first publicly available releases having these characteristics will be the developer releases Perl 5.9.x, culminating in the Perl 5.10.0 release.
es_es: Los primeros lanzamientos a disposición del público de estas características serán publicadas en la versión desarrollador Perl 5.9.x, culminando con la publicación de Perl 5.10.0.

source: Gratuitous object orientation results in complex APIs which are difficult for the average module user to understand or use.
es_es: Una orientación a objetos injustificada resulta en unas API complejas que serán difíciles de comprender o utilizar para el usuario medio del módulo.

source: On systems that don't support futimes(2), passing filehandles raises an exception.
es_es: En sistemas que no admiten futimes(2), pasarle un identificador de archivo lanza una excepción.

source: If FILEHANDLE is omitted, reads from STDIN.
es_es: Si IDENTIFICADOR_ARCHIVO se omite, se lee desde STDIN.

source: =head2 Which version of Perl should I use?
es_es: =head2 ¿Qué versión de Perl debo utilizar?

source: u Use Unicode rules
es_es: u Usa las reglas Unicode

source: C<(?#...)> comments are ignored.
es_es: C<(?#...)> los comentarios son ignorados.

source: \D [3] Match a non-digit character
es_es: \D [3] Coincide con un carácter que no es dígito

source: Before the first edition of I<Programming perl>, people commonly referred to the language as "perl", and its name appeared that way in the title because it referred to the interpreter.
es_es: Antes de la primera edición de I<Programming perl>, el lenguaje se solía llamar "perl", y su nombre aparecía así en el título porque hacía referencia al intérprete.

source: Binary "==" returns true if the left argument is numerically equal to the right argument.
es_es: Binario "==" devuelve verdadero si el argumento de la izquierda es numéricamente igual que el argumento de la derecha.

source: If you'd like to make C<system> (and many other bits of Perl) die on error, have a look at the L<autodie> pragma.
es_es: Si desea hacer que C<system> (y muchos otros fragmentos de Perl) mueran en caso de error, eche un vistazo al pragma L<autodie>.

source: Any of these modifiers can be set to apply globally to all regular expressions compiled within the scope of a C<use re>.
es_es: Cualquiera de estos modificadores pueden ser inicializados de forma global, para todas las expresiones regulares compiladas dentro del ámbito de un C<use re>.

source: continue; # Fall through
es_es: continue; # Sigue en la siguiente

source: As VM/ESA doesn't fully support the fork() API programs relying on this call will not work.
es_es: Como VM/ESA no es totalmente compatible con la API fork(), los programas que confían en esta llamada no funcionarán.

source: All the substrings which may be matched by the given regular expression can be sorted from the "best" match to the "worst" match, and it is the "best" match which is chosen.
es_es: Todas las subcadenas que pueden ser coincidentes con la expresión regular dada se pueden clasificar desde la "mejor" coincidencia hasta la "peor" coincidencia, y es la "mejor" coincidencia la que es elegida.

source: =head2 Switch statements X<switch> X<case> X<given> X<when> X<default>
es_es: =head2 Instrucciones Switch X<switch> X<case> X<given> X<when> X<default>

source: && ^ string begin /i case insens.
es_es: && ^ principio cadena /i no distingue may./min.

source: eval { local $SIG{'__DIE__'}; $answer = $a / $b; };
es_es: eval { local $SIG{'__DIE__'}; $respuesta = $a / $b; };

source: For the inverse sine operation, you may use the C<Math::Trig::asin> function, or use this relation:
es_es: Para la inversa de la operación seno, puede usar la función C<Math::Trig::asin()>, o usar esta relación:

source: (The good news is that B::Bytecode and ByteLoader are better than they used to be.)
es_es: (Las buenas noticias es que B::Bytecode y ByteLoader son mejores de lo que solía ser.)

source: $string =~ /$re/; # or this way
es_es: $cadena =~ /$re/; # o de esta manera

source: printf "format s is %d, s!
es_es: printf "formato s es %d, s!

source: If C<$@> is empty then the string C<"Warning: Something's wrong"> is used.
es_es: Si C<$@> está vacío entonces se usa la cadena C<"Warning: Something's wrong">.

source: open(my $in, "<", "input.txt") or die "Can't open input.txt: $!";
es_es: open(my $entrada, "<", "entrada.txt") or die "No se puede abrir entrada.txt: $!";

source: \Q quote (disable) pattern metacharacters till \E
es_es: \Q escapa (desactiva) los metacaracteres hasta \E

source: Use sysread() and check for a return value for 0 to decide whether you're done.
es_es: Use sysread() y compruebe si el valor devuelto es 0 para decidir si ha llegado al final.

source: foreach $word (@words) {
es_es: foreach $palabra (@palabras) {

source: See L<perlvar/"$/"> and L<perlvar/"$.">.
es_es: Ver L<perlvar/"$/"> y L<perlvar/"$.">.

# print "japh Junk" & '_____'; # prints "JAPH ";
source: print "japh\nJunk" & '_____'; # prints "JAPH\n";
es_es: print "japh\nJunk" & '_____'; # imprime "JAPH\n";

source: Scalars aren't necessarily one thing or another.
es_es: Los escalares no tienen que ser necesariamente una cosa o la otra.

source: Using a C<__WARN__> handler provides a powerful way to silence all warnings (even the so-called mandatory ones).
es_es: El uso de un controlador C<__WARN__> proporciona una poderosa manera de silenciar a todas las advertencias (incluso las no menos llamadas obligatorias).

source: You might be tempted to use C<$#array + 1> to tell you how many items there are in an array.
es_es: Podría sentirse tentado de usar C<$#array + 1> para determinar el número de elementos de un array.

source: A file test, where X is one of the letters listed below.
es_es: Un test de archivo, donde X es una de las letras listadas abajo.

source: The last two examples in each block show the pipe as "list form", which is not yet supported on all platforms.
es_es: Los dos últimos ejemplos de cada bloque muestra la tubería como "en forma de lista", que todavía no está soportado en todas las plataformas.

source: The repeat count should not be more than 65.
es_es: El número de repeticiones no debe ser mayor de 65.

source: See L</"Updated Modules"> for more details.
es_es: Vea L</"Módulos actualizados"> para más detalles.

source: The values for WHENCE are C<0> to set the new position I<in bytes> to POSITION; C<1> to set it to the current position plus POSITION; and C<2> to set it to EOF plus POSITION, typically negative.
es_es: Los valores de DÓNDE son C<0> para poner la nueva posición I<en bytes> a POSICIÓN; C<1> para poner la posición actual más POSICIÓN; y C<2> para ponerlo a EOF más POSICIÓN, normalmente negativo.

source: He will be missed.
es_es: Le echaremos de menos.

source: decimal string --> native integer
es_es: cadena decimal --> entero nativo

source: The Unix touch(1) command will in fact normally use this form instead of the one shown in the first example.
es_es: El comando de Unix touch(1), de hecho, utilizará esta forma en lugar de la que se muestra en el primer ejemplo.

source: L<perlmod> describes Perl modules in general.
es_es: En L<perlmod> se describen los módulos de Perl en general.

source: When used as a number, C<undef> is treated as C<0>; when used as a string, it is treated as the empty string, C<"">; and when used as a reference that isn't being assigned to, it is treated as an error.
es_es: Cuando se usa como un número, C<undef> es tratado como si fuera C<0>; cuando se usa como una cadena de caracteres (I<string>), se trata como el string vacío, C<"">; y cuando se usa como una referencia que no ha sido asignada, es tratado como un error.

source: Not everything is mentioned, but 195 features may already be overwhelming.
es_es: No abarca todo, pero incluye 195 características del lenguaje; no es mal comienzo.

source: \u uppercase next char (think vi)
es_es: \u pasar a mayúscula el siguiente carácter (como en vi)

source: STORE this, key, value
es_es: STORE este, clave, valor

source: This happens immediately, so C<$^R> can be used from other C<(?{ code })> assertions inside the same regular expression.
es_es: Esto ocurre de forma inmediata, por lo que C<$^R> puede ser usada desde otras aserciones C<(?{ código })> dentro de la misma expresión regular.

source: It should look something like:
es_es: Debe ser algo como:

source: Furthermore, any object code linked with perl does not automatically fall under the terms of the GPL, provided such object code only adds definitions of subroutines and variables, and does not otherwise impair the resulting interpreter from executing any standard Perl script.
es_es: Además, cualquier código objeto enlazado con perl no será afectado por los términos de la GPL, siempre y cuando el código objeto sólo agregue definiciones de subrutinas y variables, y de ningún otro modo ponga en peligro el resultante intérprete de la ejecución de cualquier script estándar de Perl.

source: You also don't have to use push().
es_es: Tampoco tiene por qué usar push().

source: =item L<c2ph|c2ph> and L<pstruct|pstruct>
es_es: =item L<c2ph|c2ph> y L<pstruct|pstruct>

source: It allows you to install modules or distributions from CPAN, or just get information about them, and a lot more.
es_es: Permite hacer muchas cosas, como instalar módulos o distribuciones de CPAN, o simplemente obtener información sobre ellas.

source: Enhanced documentation and typo fixes
es_es: Documentación mejorada y errores ortográficos arreglados

source: Suppose you are running script "canasta".
es_es: Suponga que está corriendo el script "canasta".

source: Your module will be part of a developer's toolkit.
es_es: Su módulo será parte del conjunto de herramientas del desarrollador.

source: This is mainly an internal issue that only affects people actively working on the perl core; but it may have minor external visibility, for example in some of details of the output of C<perl -V>.
es_es: Esto es principalmente un asunto interno que sólo afecta a las personas que trabajan activamente en el núcleo de perl; pero puede tener visibilidad externa de menor importancia, por ejemplo, en algunos de los detalles de la salida de C<perl -V>.

source: Modules which are "stable" should not break backwards compatibility without at least a long transition phase and a major change in version number.
es_es: Los módulos que sean "estables" no deben romper la compatibilidad hacia atrás sin al menos una larga fase de transición y un cambio importante en el número de versión.

source: The C<Config> module will also let you interrogate values determined by the B<Configure> program when Perl was installed.
es_es: El módulo C<Config> le permitirá también interrogar por los valores determinados por el programa B<Configure> cuando Perl fue instalado.

source: =head2 Basic syntax overview
es_es: =head2 Descripción general de la sintaxis básica

source: =item fileno FILEHANDLE X<fileno>
es_es: =item fileno IDENTIFICADOR_ARCHIVO X<fileno>

source: It is worth noting that C<\G> improperly used can result in an infinite loop.
es_es: Cabe señalar que C<\G> mal utilizado puede resultar en un bucle infinito.

source: Although a scalar may not directly hold multiple values, it may contain a reference to an array or hash which in turn contains multiple values.
es_es: Aunque un escalar no puede contener directamente múltiples valores, podría contener una referencia a un array o un hash, los cuales a su vez sí que pueden contener múltiples valores.

source: my @a = complex_calculation();
es_es: my @a = calculo_complejo();

source: Note that according to the POSIX 1003.1-1996 the FILENAME may have any number of trailing slashes.
es_es: Tenga en cuenta que de acuerdo con POSIX 1.003.1-1996, el nombre de archivo puede tener cualquier número de barras inclinadas.

source: Sorry.
es_es: Lo sentimos.

source: untouched.
es_es: intacta.

source: On platforms with 64 bit pointers numeric comparison operators used to erroneously compare the addresses of references that are overloaded, rather than using the overloaded values.
es_es: En las plataformas con punteros de 64 bits los operadores de comparación numéricos eran erróneamente usados para comparar las direcciones de las referencias que estaban sobrecargadas, en lugar de utilizar los valores sobrecargados.

source: Length of the name.
es_es: Longitud del nombre.

source: perltoc Perl documentation table of contents
es_es: perltoc Tabla de contenido de la documentación de Perl

source: As with regular pattern matching, any capturing parentheses that are not matched in a C<split()> will be set to C<undef> when returned:
es_es: Al igual que con la coincidencia de patrones regulares, cualquier paréntesis de captura que no coincida en un C<split()> se establecerá a C<undef>:

source: Empty C<DESTROY> methods are no longer called.
es_es: Ya no son llamados los métodos C<DESTROY> vacíos.

source: The C<AvFLAGS> macro has been removed.
es_es: La macro C<AvFLAGS> se ha eliminado.

source: || // $ str.
es_es: || // $ fin

source: perltooc Perl OO tutorial, part 2
es_es: perltooc Programación orientada a objetos, parte 2

# print { $OK ? STDOUT : STDERR } "stuff ";
source: print { $OK ? STDOUT : STDERR } "stuff\n";
es_es: print { $OK ? STDOUT : STDERR } "cosas\n";

source: is like
es_es: es como

source: DESCRIPTION
es_es: DESCRIPCIÓN

source: which is Perl short-hand for the more explicitly written version:
es_es: que es la versión corta de la versión más explícita:

source: For instance, C<$$> is the current process id.)
es_es: Por ejemplo, C<$$> es el ID del proceso actual).

source: For constructs that do interpolate, variables beginning with "C<$>" or "C<@>" are interpolated.
es_es: Para las construcciones que hacen interpolación, las variables que empiezan por "C<$>" o "C<@>" son interpoladas.

source: A common mistake is to try to separate the words with comma or to put comments into a multi-line C<qw>-string.
es_es: Un error común es tratar de separar las palabras con una coma o poner comentarios en una cadena C<qw> multilínea.

source: $element_count = scalar(@whatever);
es_es: $contador_elementos = scalar(@loquesea);

source: The C<goto-EXPR> form expects a label name, whose scope will be resolved dynamically.
es_es: La forma C<goto>-EXPR espera un nombre de etiqueta, cuyo ámbito será resuelto dinámicamente.

source: print "Hello
es_es: print "Hola

source: In some cases, quite a lot faster, actually.
es_es: En algunos casos, mucho más rápido, en realidad.

source: This zero-width pattern can be used to mark the point reached in a string when a certain part of the pattern has been successfully matched.
es_es: Este patrón de ancho cero puede ser utilizado para marcar el punto alcanzado en una cadena cuando una parte del patrón ha sido encontrado con éxito.

source: $line = <STDIN>;
es_es: $linea = <STDIN>;

source: You can read from an open filehandle using the C<< <> >> operator.
es_es: Puede utilizar el operador C<< <> >> para leer de un identificador de archivo abierto.

source: Things that make Perl easier to learn: Unix experience, almost any kind of programming experience, an understanding of regular expressions, and the ability to understand other people's code.
es_es: Si tiene experiencia en el uso de Unix, cualquier tipo de experiencia en programación, conocimientos de expresiones regulares y la capacidad de leer y entender el código de otros programadores, le costará menos aprender Perl.

source: These rules look complicated, but usually they will do what you want.
es_es: Estas reglas parecen complicadas, pero usualmente harán lo que usted desea.

source: I A unsigned integer value.
es_es: I Un valor entero sin signo.

source: Compile with C<-DPERL_USE_LARGE_HV_ALLOC> to use the old, sloppier, default.
es_es: Compile con C<-DPERL_USE_LARGE_HV_ALLOC> para usar el viejo, descuidado, valor por defecto.

source: Just as in the shell, a backslashed bareword following the C<<< << >>> means the same thing as a single-quoted string does:
es_es: Al igual que en el I<shell>, una palabra suelta con contrabarras siguiendo a C<<< << >>> significa lo mismo que una cadena entrecomillada simple:

source: Same for a L<quantifier|/Quantifiers> such as C<{3}> or C<{5,}>.
es_es: Lo mismo para los L<cuantificadores|Cuantificadores> como C<{3}> o C<{5,}>.

source: ? zero or one of the previous thing
es_es: ? cero o una coincidencias de lo anterior

source: While there may be a bug somewhere in Perl's configuration or C<ExtUtil::MakeMaker> causing the problem, the most likely cause is an incomplete understanding of Sun Studio by this author.
es_es: Si bien puede haber un error en algún lugar de configuración de Perl o C<ExtUtil::MakeMaker> que sea la razón del problema, la causa más probable es una comprensión incompleta de Sun Studio por parte de este autor.

source: Note that the "Matching Code" column is not always an exact rendition.
es_es: Note que la columna "Código similar" no siempre es una interpretación exacta.

source: Otherwise, it is best to use this construct only for ordinals C<\077> and below, remembering to pad to the left with zeros to make three digits.
es_es: De lo contrario, es mejor utilizar esta construcción sólo para los ordinales C<\077> e inferiores, recordando que hay que rellenar a la izquierda con ceros, para tener los tres dígitos.

source: This makes it more useful to implement lexical pragmas.
es_es: Esto hace que sea más útil para implementar pragmas léxicos.

source: Checks if a group with the given name has matched something.
es_es: Comprueba si el grupo con el nombre indicado ha coincidido con algo.

source: A typical use of the returned seed is for a test program which has too many combinations to test comprehensively in the time available to it each run.
es_es: Un uso típico de la semilla devuelta es para un programa de prueba que tiene demasiadas combinaciones que probar, exhaustivamente, en el tiempo disponible para cada ejecución.

source: A A text (ASCII) string, will be space padded.
es_es: A Una cadena de texto (ASCII), será rellenada con espacios.

source: By default all sockets operate on bytes, but for example if the socket has been changed using binmode() to operate with the C<:encoding(utf8)> I/O layer (see the C<open> pragma, L<open>), the I/O will operate on UTF8-encoded Unicode characters, not bytes.
es_es: Por defecto todos los I<sockets> operan en bytes, pero por ejemplo si el I<socket> ha sido cambiado usando binmode() para operar con la capa de E/S C<:encoding(utf8)> (ver el pragma C<open>, L<open>), la E/S operará en caracteres codificados en UTF-8, no bytes.

source: Returns the context of the current subroutine call.
es_es: Devuelve el contexto de la llamada a la subrutina actual.

source: But method calls such as C<< $obj->meth >> are not.
es_es: Pero llamadas a métodos como C<< $objeto->metodo >>, no.

source: Note that, unlike C<if> and C<unless>, failed C<when> statements always evaluate to an empty list.
es_es: Tenga en cuenta que, a diferencia de C<if> y C<unless>, las instrucciones fallidas de C<when> siempre se evalúan a una lista vacía.

source: While literal lists and named arrays are often interchangeable, that's not the case for hashes.
es_es: Si bien las listas literales y los array nominales a menudo, son intercambiables, este no es el caso de los hashes.
